#include<iostream>
using namespace std;
int main(){
    int a[]={8,3,6,2,7,1};
    int n=6;
    for(int x=0;x<n-1;x=x+1){
        for(int y=0;y<n-x-1;y=y+1){
            if(a[y]>a[y+1]){
                int z=a[y];
                a[y]=a[y+1];
                a[y+1]=z;
            }
        }
    }
    cout<<"从大到小排序：";
    for(int x=0;x<n;x=x+1){
        cout<<a[x]<<" ";
    }
    cout<<endl;
    return 0;
}
/*
1.我的程序是如何完成排序的：通过if判断，若一个数大于它后面的数则借助临时变量将它们换位；且通过for循环的内层循环依次比较相邻的数，外层循环进行多轮排序。
2.冒泡排序的基本思路是什么：重复地走访要排序的数列，一次比较两个相邻的元素，如果它们的顺序不符合要求（比如从小到大排列时，前一个比后一个大），就把它们交换过来。在这个程序中，越小的元素会经由交换慢慢“浮”到数列的顶端，就像水中的气泡一样。
3.如果要改成从大到小排序，需要修改哪里：将if判断中的小于号修改为大于号，即将“if(a[y]>a[y+1])”修改为“if(a[y]>a[y+1])”。
*/